In [4]:
import numpy as np
import pandas as pd

In [ ]:
# missing data

In [2]:
d = {'a':[1,2,np.nan],'b':[5,np.nan,np.nan],'c':[1,2,3]}

In [7]:
df = pd.DataFrame(d)
df

     a    b  c
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [8]:
df.dropna()

     a    b  c
0  1.0  5.0  1

In [9]:
df.dropna(axis=1)

   c
0  1
1  2
2  3

In [10]:
df.dropna(thresh=2)

     a    b  c
0  1.0  5.0  1
1  2.0  NaN  2

In [11]:
df.fillna(value='Fill Value')

            a           b  c
0           1           5  1
1           2  Fill Value  2
2  Fill Value  Fill Value  3

In [12]:
df['a'].fillna(value=df['a'].mean())

0    1.0
1    2.0
2    1.5
Name: a, dtype: float64

In [13]:
# groups by with pandas

In [14]:
data = {'company':['goog','goog','msft','msft','fb','fb'],
        'person':['sam','charlie','amy','vanessa','carl','sarah'], 
        'sales':[200,120,340,124,243,350]}

In [15]:
df = pd.DataFrame(data)

In [16]:
df

  company   person  sales
0    goog      sam    200
1    goog  charlie    120
2    msft      amy    340
3    msft  vanessa    124
4      fb     carl    243
5      fb    sarah    350

In [19]:
bycomp = df.groupby('company')

In [20]:
bycomp.mean()

         sales
company
fb       296.5
goog     160.0
msft     232.0

In [21]:
bycomp.sum()

         sales
company
fb         593
goog       320
msft       464

In [22]:
bycomp.std()

              sales
company
fb        75.660426
goog      56.568542
msft     152.735065

In [23]:
bycomp.sum().loc['fb']

sales    593
Name: fb, dtype: int64

In [24]:
df.groupby('company').sum().loc['fb']

sales    593
Name: fb, dtype: int64

In [25]:
df.groupby('company').count()

         person  sales
company
fb            2      2
goog          2      2
msft          2      2

In [26]:
df.groupby('company').max()

          person  sales
company
fb         sarah    350
goog         sam    200
msft     vanessa    340

In [28]:
df.groupby('company').min()

          person  sales
company
fb          carl    243
goog     charlie    120
msft         amy    124

In [31]:
df.groupby('company').describe()

        sales
        count   mean         std    min     25%    50%     75%    max
company
fb        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
goog      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
msft      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [32]:
df.groupby('company').describe().transpose()

company              fb        goog        msft
sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [34]:
df.groupby('company').describe().transpose()['fb']

sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: fb, dtype: float64